bindings/servicemix-cxf-bc/src/test/resources/org/apache/servicemix/cxfbc/wsn/WSN_PortTypes.wsdl

<?xml version="1.0" ?>
<wsdl:definitions name="Sample-WSN-Notification-Subscription"
  xmlns="http://schemas.xmlsoap.org/wsdl/"
  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:wsa="http://www.w3.org/2005/08/addressing"
  xmlns:wsn-br="http://docs.oasis-open.org/wsn/br-2" 
  xmlns:wsn-brw="http://docs.oasis-open.org/wsn/brw-2"
  xmlns:wsn-b="http://docs.oasis-open.org/wsn/b-2"
  xmlns:wsn-bw="http://docs.oasis-open.org/wsn/bw-2"
  xmlns:wsrf-bf="http://docs.oasis-open.org/wsrf/bf-2"   
  xmlns:wsrf-rw="http://docs.oasis-open.org/wsrf/rw-2" 
  targetNamespace="http://sample.com/wsn">

<!-- ========================== Imports =========================== --> 
 <wsdl:import namespace="http://docs.oasis-open.org/wsrf/rw-2" 
       location="rw-2.wsdl"/>
       
 <wsdl:import namespace="http://docs.oasis-open.org/wsn/bw-2" 
       location="bw-2.wsdl"/>
<!-- ===================== Types Definitions ====================== -->
   <wsdl:types>
     <xsd:schema>
       <xsd:import
         namespace="http://docs.oasis-open.org/wsn/b-2" 
         schemaLocation="b-2.xsd"/>
       <xsd:import
         namespace="http://docs.oasis-open.org/wsn/br-2" 
         schemaLocation="br-2.xsd"/>
     </xsd:schema>
   </wsdl:types>


<!-- ========== NotificationBroker PortType Definition ============ -->
   <wsdl:portType name="NotificationBroker">
      <!-- ============= extends NotificationConsumer ============= -->
      <wsdl:operation name="Notify">
         <wsdl:input message="wsn-bw:Notify" />
      </wsdl:operation>
      
      <!-- ============= extends NotificationProducer ============= -->
      <wsdl:operation name="Subscribe">
         <wsdl:input  message="wsn-bw:SubscribeRequest" />
         <wsdl:output message="wsn-bw:SubscribeResponse" />
         <wsdl:fault  name="ResourceUnknownFault" 
                      message="wsrf-rw:ResourceUnknownFault" />
         <wsdl:fault  name="InvalidFilterFault" 
                   message="wsn-bw:InvalidFilterFault"/>
         <wsdl:fault  name="TopicExpressionDialectUnknownFault" 
                   message="wsn-bw:TopicExpressionDialectUnknownFault"/>
         <wsdl:fault  name="InvalidTopicExpressionFault" 
                      message="wsn-bw:InvalidTopicExpressionFault" />
         <wsdl:fault  name="TopicNotSupportedFault" 
                      message="wsn-bw:TopicNotSupportedFault" />
         <wsdl:fault  name="InvalidProducerPropertiesExpressionFault" 
             message="wsn-bw:InvalidProducerPropertiesExpressionFault"/>
         <wsdl:fault  name="InvalidMessageContentExpressionFault" 
             message="wsn-bw:InvalidMessageContentExpressionFault"/>
         <wsdl:fault  name="UnacceptableInitialTerminationTimeFault" 
             message="wsn-bw:UnacceptableInitialTerminationTimeFault"/>
         <wsdl:fault  name="UnrecognizedPolicyRequestFault" 
             message="wsn-bw:UnrecognizedPolicyRequestFault"/>
         <wsdl:fault  name="UnsupportedPolicyRequestFault" 
             message="wsn-bw:UnsupportedPolicyRequestFault"/>
         <wsdl:fault  name="NotifyMessageNotSupportedFault" 
             message="wsn-bw:NotifyMessageNotSupportedFault"/>
         <wsdl:fault  name="SubscribeCreationFailedFault" 
                      message="wsn-bw:SubscribeCreationFailedFault"/>
      </wsdl:operation>
   </wsdl:portType>

<!-- ========== SubscriptionManager PortType Definition =========== -->
   <wsdl:portType name="SubscriptionManager">
      <wsdl:operation name="Unsubscribe">
         <wsdl:input  name="UnsubscribeRequest" 
                      message="wsn-bw:UnsubscribeRequest" />
         <wsdl:output name="UnsubscribeResponse" 
                      message="wsn-bw:UnsubscribeResponse" />
         <wsdl:fault  name="ResourceUnknownFault" 
                      message="wsrf-rw:ResourceUnknownFault" />
         <wsdl:fault  name="UnableToDestroySubscriptionFault" 
                      message=
                      "wsn-bw:UnableToDestroySubscriptionFault" />
      </wsdl:operation>
    </wsdl:portType> 
</wsdl:definitions>
